In [1]:
# 라이브러리 가져오기
import pandas as pd # Series, DataFrame 사용
import numpy as np # 값을 생성하는데 사용

### 계층 색인

- 행, 열의 각 축에 대해 다중 단계(계층)를 지정하여 데이터에 차원을 설정
- 인덱스에 다차원 리스트를 전달하면 계층 색인을 지정할 수 있음
- 데이터 구조를 재배열하거나 pivot 테이블과 같은 그룹 기반 작업에 유용
- 재배열 메서드
    - stack() : 컬럼을 로우로 피벗
    - unstack() : 로우를 컬럼으로 피벗

In [2]:
# Seires
# 인덱스에 다차원 리스트(아이템 2개)를 전달
# 다차원리스트[0] 상위계층
# 상위계층 작성시 주의점 : 각 계층별로 속하는 하위계층 값의 개수만큼 계층명 작성
# 상위계층 리스트 개수 = 하위계층 리스트 개수
# 다차원리스트[1] : 하위계층
# 실습 --->
# 로우 인덱스 = 상위계층 : a, b, c, d
# 하위 계층 : a(1, 2, 3), b(1, 2), c(1, 2, 3, 4), d(1)
s1 = pd.Series(np.arange(10), index=[['a','a','a','b','b','c','c','c','c','d'],
                                    [1, 2, 3, 1, 2, 1, 2, 3, 4, 1]])
s1

a  1    0
   2    1
   3    2
b  1    3
   2    4
c  1    5
   2    6
   3    7
   4    8
d  1    9
dtype: int32

In [3]:
# 인덱스 확인
s1.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('c', 1),
            ('c', 2),
            ('c', 3),
            ('c', 4),
            ('d', 1)],
           )

In [4]:
# 상위계층에 접근
# 계층 색인이 적용된 객체에 상위 인덱스에 접근 : 일반적인 Series 인덱싱으로 접근
s1['c']

1    5
2    6
3    7
4    8
dtype: int32

In [5]:
# 계층색인에 대한 슬라이싱 : 마지막 인덱스도 포함('b' : 'd' 로 입력시 b, c, d로 조회)
s1['b':'d']

b  1    3
   2    4
c  1    5
   2    6
   3    7
   4    8
d  1    9
dtype: int32

In [6]:
# 하위계층에 접근
# a, b, c, d 에서 하위계층 라벨번호 2인 데이터만 조회
# 데이터[상위계층명, 하위계층번호]
s1[:, 2]

a    1
b    4
c    6
dtype: int32

In [7]:
# 하위 계층에 슬라이싱 : loc메서드를 이용해서 슬라이싱
# 상위계층이 c이고, 하위계층을 2~4까지 슬라이싱(.loc는 마지막 번호도 포함)
s1['c'].loc[2:4]

2    6
3    7
4    8
dtype: int32

In [8]:
# unstack() : 최하위(기본동작)에 있는 로우 계층을 컬럼으로 적용하여 위로 올림
# Series 객체를 DataFrame화 할 수 있음
# NaN : 기존에 없던 로우 계층에 대한 값
s1.unstack()

     1    2    3    4
a  0.0  1.0  2.0  NaN
b  3.0  4.0  NaN  NaN
c  5.0  6.0  7.0  8.0
d  9.0  NaN  NaN  NaN

In [9]:
# stack() 메서드 : 컬럼에 있던 값을 가장 하위 인덱스로 내려서 재배열
# DataFrame을 다시 Series화 할때 사용
s1.unstack().stack()

a  1    0.0
   2    1.0
   3    2.0
b  1    3.0
   2    4.0
c  1    5.0
   2    6.0
   3    7.0
   4    8.0
d  1    9.0
dtype: float64

In [46]:
# DataFrame 생성
# 구조 : 4 * 5
# 로우 인덱스 : 상위(2017, 2018) / 하위(모든 상위 인덱스에 대해 동일하게 a, b)
# 컬럼 인덱스 : 상위(서울, 경기) / 하위(서울-강남, 잠실 / 경기-안양, 수원, 판교)
# 값 : 1씩 증가하는 20개
df = pd.DataFrame(np.arange(20).reshape(4, 5), index=[[2017,2017,2018,2018],['a','b','a','b']], columns=[['서울','서울','경기','경기','경기'],['강남','잠실','안양','수원','판교']])
df

        서울      경기
        강남  잠실  안양  수원  판교
2017 a   0   1   2   3   4
     b   5   6   7   8   9
2018 a  10  11  12  13  14
     b  15  16  17  18  19

In [48]:
# 컬럼의 상위 계층 접근 : 일반적인 df컬럼 인덱싱 방식
# '서울' 데이터 조회
df['서울']

        강남  잠실
2017 a   0   1
     b   5   6
2018 a  10  11
     b  15  16

In [49]:
# 컬럼이 이중으로 구조가 만들어져있으므로 인덱싱도 이중으로 해야 하나의 요소를 지정할 수 있음
df['서울']['강남']

2017  a     0
      b     5
2018  a    10
      b    15
Name: 강남, dtype: int32

In [50]:
# 튜플로 전달시 하나의 리스트로 2개 이상의 계층 처리 가능
df[('서울','강남')]

2017  a     0
      b     5
2018  a    10
      b    15
Name: (서울, 강남), dtype: int32

In [56]:
# row의 상위 계층 접근
# 2017년 데이터를 조회해주세요
df.loc[2017]

  서울    경기
  강남 잠실 안양 수원 판교
a  0  1  2  3  4
b  5  6  7  8  9

In [62]:
# 2017년도 전반기(a)데이터 조회
df.loc[2017].loc['a']

서울  강남    0
    잠실    1
경기  안양    2
    수원    3
    판교    4
Name: a, dtype: int32

In [66]:
# 위 조회구문에서 데이터를 튜플로 전달하기
df.loc[(2017,'a')]

서울  강남    0
    잠실    1
경기  안양    2
    수원    3
    판교    4
Name: (2017, a), dtype: int32

In [87]:
# 안양 ~ 수원까지 데이터 조회
# 주의점 : 데이터프레임 컬럼은 row 슬라이싱 결과에 대해서만 컬럼슬라이싱 적용 가능
# df['경기']['안양':'수원'] 은 오류남
df['경기'].loc[:,'안양':'수원']

        안양  수원
2017 a   2   3
     b   7   8
2018 a  12  13
     b  17  18

In [89]:
# row의 최하위계층(a,b)를 컬럼으로 올리기 : 
df.unstack()

      서울              경기
      강남      잠실      안양      수원      판교
       a   b   a   b   a   b   a   b   a   b
2017   0   5   1   6   2   7   3   8   4   9
2018  10  15  11  16  12  17  13  18  14  19

In [91]:
# 컬럼 최하위계층을 로우의 하위계층으로 재배열 : 
df.stack()

             경기    서울
2017 a 강남   NaN   0.0
       수원   3.0   NaN
       안양   2.0   NaN
       잠실   NaN   1.0
       판교   4.0   NaN
     b 강남   NaN   5.0
       수원   8.0   NaN
       안양   7.0   NaN
       잠실   NaN   6.0
       판교   9.0   NaN
2018 a 강남   NaN  10.0
       수원  13.0   NaN
       안양  12.0   NaN
       잠실   NaN  11.0
       판교  14.0   NaN
     b 강남   NaN  15.0
       수원  18.0   NaN
       안양  17.0   NaN
       잠실   NaN  16.0
       판교  19.0   NaN

In [92]:
# 계층의 인덱스번호 또는 라벨을 사용하여 상, 하위간 교환
# swapleve(key1, key2, axis=0(기본값))
# axis가 0인 경우는 row의 상하위 개념이 뒤집힌다
df.swaplevel(1,0)

        서울      경기
        강남  잠실  안양  수원  판교
a 2017   0   1   2   3   4
b 2017   5   6   7   8   9
a 2018  10  11  12  13  14
b 2018  15  16  17  18  19

In [95]:
# swaplevel에 axis=1을 주면 계층이 아닌 컬럼에 변동이 생깁니다.
df.swaplevel(1, 0, axis=1)

        강남  잠실  안양  수원  판교
        서울  서울  경기  경기  경기
2017 a   0   1   2   3   4
     b   5   6   7   8   9
2018 a  10  11  12  13  14
     b  15  16  17  18  19

### 객체 복사

- 할당기호(=) / 슬라이싱 : 원본과 상호 종속적인 복사본 객체 생성(얕은복사)
- obj.copy() : 원본과 독립적인 복사본 객체 생성(깊은복사)

In [97]:
# 모든 값이 1인 5 * 1 구조의 Series 생성
s1 = pd.Series(np.ones(5))
s1

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
dtype: float64

In [98]:
# 할당기호 = 로 복사 : 얕은복사
s2 = s1

In [100]:
# 할당기호로 복사한 객체의 아이템 수정
s2[0] = 10
s2

0    10.0
1     1.0
2     1.0
3     1.0
4     1.0
dtype: float64

In [101]:
# =를 이용한 대입은 원본객체도 동시에 변경됨
s1

0    10.0
1     1.0
2     1.0
3     1.0
4     1.0
dtype: float64

In [102]:
# 원본객체의 아이템 수정
s1[1] = 3
s1

0    10.0
1     3.0
2     1.0
3     1.0
4     1.0
dtype: float64

In [103]:
# 복사본도 영향 받음
s2

0    10.0
1     3.0
2     1.0
3     1.0
4     1.0
dtype: float64

In [104]:
# 슬라이싱으로 복사(일반 파이썬 -> 깊은복사, pandas-> 얕은복사로 취급됨)
s3 = s1[:]
s3

0    10.0
1     3.0
2     1.0
3     1.0
4     1.0
dtype: float64

In [106]:
# 복사본객체 아이템 수정
s3[2] = -9

0    10.0
1     3.0
2    -9.0
3     1.0
4     1.0
dtype: float64

In [110]:
# s1과 s3확인
print(s1)
print("-----------")
print(s3)

0    10.0
1     3.0
2    -9.0
3     1.0
4     1.0
dtype: float64
-----------
0    10.0
1     3.0
2    -9.0
3     1.0
4     1.0
dtype: float64

In [111]:
# .copy()를 이용한 깊은 복사(복사)
s4 = s1.copy()

In [112]:
# s4를 수정
s4[4] = 44

In [113]:
s4

0    10.0
1     3.0
2    -9.0
3     1.0
4    44.0
dtype: float64

In [114]:
s1

0    10.0
1     3.0
2    -9.0
3     1.0
4     1.0
dtype: float64

In [115]:
# s1을 변경하는 경우에도 s4는 영향받지 않음
s1[0] = 0
s1

0    0.0
1    3.0
2   -9.0
3    1.0
4    1.0
dtype: float64

In [116]:
s4

0    10.0
1     3.0
2    -9.0
3     1.0
4    44.0
dtype: float64

### 정렬

- obj.sort_index() : 인덱스를 기준으로 정렬 (기본값은 ascending=True, 오름차순 정렬)
    - DataFrame, Series
        - axis = 0 : 기본값, 로우 인덱스 기준으로 정렬
        - axis = 1 : 컬럼 인덱스 기준으로 정렬
- obj.sort_values() : 값을 기준으로 정렬
    - DataFrame, Series
        - by : 정렬의 기준이 되는 인덱스 값 전달
        - axis = 0 : 기본값, 컬럼을 기준으로 로우 인덱스를 정렬하며 기준값으로 by에 인덱스 컬럼 레벨 또는 컬럼명 전달
        - axis = 1 : 로우 인덱스를 기준으로 컬럼 라벨을 정렬하며 기준값으로 by에 레벨 또는 라벨명 전달

In [118]:
# Series 생성
# 값과 인덱스라벨이 순서대로 들어가지 않은 Series
s1 = pd.Series([2, 3, 1, 7, 0], index=list('gacfd'))
s1

g    2
a    3
c    1
f    7
d    0
dtype: int64

In [119]:
# 인덱스 기준 오름차순으로 정렬
# 기본동작 : 오름차순 & 로우 인덱스
s1.sort_index()

a    3
c    1
d    0
f    7
g    2
dtype: int64

In [120]:
# 인덱스 기준 내림차순으로 정렬
s1.sort_index(ascending=False)

g    2
f    7
d    0
c    1
a    3
dtype: int64

In [121]:
# 일시적 변경이므로 s1에는 반영되지는 않습니다
s1

g    2
a    3
c    1
f    7
d    0
dtype: int64

In [122]:
# 값 기준 오름차순으로 정렬
s1.sort_values()

d    0
c    1
g    2
a    3
f    7
dtype: int64

In [124]:
# 값 기준 내림차순으로 정렬
s1.sort_values(ascending=False)

f    7
a    3
g    2
c    1
d    0
dtype: int64

In [136]:
np.random.seed(1234)

In [137]:
# DataFrame 생성
# 4 * 5 무작위 정수 (np.random.randint())
# 로우/컬럼 인덱스도 순서가 없는 값 지정
# 로우 'hcae', 컬럼은 'EAFCD'

df1 = pd.DataFrame(np.random.randint(20, size=(4, 5)), index=list('hcae'), columns=list('EAFCD'))
df1

    E   A   F   C   D
h  15  19   6  12  15
c  17   9  11  12  16
a   5  16   9  15  18
e  16  12   5   2   6

In [139]:
# 로우 인덱스 기준으로 오름차순 정렬(axis=0)
df1.sort_index()

    E   A   F   C   D
a   5  16   9  15  18
c  17   9  11  12  16
e  16  12   5   2   6
h  15  19   6  12  15

In [140]:
# 로우 인덱스 기준으로 내림차순 정렬(axis = 0)
df1.sort_index(ascending=False)

    E   A   F   C   D
h  15  19   6  12  15
e  16  12   5   2   6
c  17   9  11  12  16
a   5  16   9  15  18

In [141]:
# 컬럼명 기준으로 오름차순 정렬(axis=1)
df1.sort_index(axis=1)

    A   C   D   E   F
h  19  12  15  15   6
c   9  12  16  17  11
a  16  15  18   5   9
e  12   2   6  16   5

In [142]:
# 컬럼명 기준으로 내림차순 정렬
df1.sort_index(ascending=False, axis=1)

    F   E   D   C   A
h   6  15  15  12  19
c  11  17  16  12   9
a   9   5  18  15  16
e   5  16   6   2  12

In [144]:
# 컬럼 기준으로 내림차순 정렬 후, 로우 기준으로 오름차순 정렬
df1.sort_index(axis=1, ascending=False).sort_index()

    F   E   D   C   A
a   9   5  18  15  16
c  11  17  16  12   9
e   5  16   6   2  12
h   6  15  15  12  19

In [150]:
# 값 기준으로 정렬
# 컬럼 D의 값을 기준으로 오름차순 정렬
# sort_values(axis=0, by='기준컬럼명') : 기본동작(정렬결과를 로우에 반영)
df1.sort_values(by='D')

    E   A   F   C   D
e  16  12   5   2   6
h  15  19   6  12  15
c  17   9  11  12  16
a   5  16   9  15  18

In [151]:
# 컬럼 A를 기준으로 내림차순 정렬
df1.sort_values(by='A', ascending=False)

    E   A   F   C   D
h  15  19   6  12  15
a   5  16   9  15  18
e  16  12   5   2   6
c  17   9  11  12  16

In [152]:
# 인덱스라벨(row) c의 값을 오름차순으로 정렬
# 결과적으로 정렬되는 대상 : 컬럼
# 정렬의 기준 : row 라벨
df1.sort_values(axis=1, by='c')

    A   F   C   D   E
h  19   6  12  15  15
c   9  11  12  16  17
a  16   9  15  18   5
e  12   5   2   6  16

In [153]:
# 로우'e'를 기준으로 값을 내림차순으로 정렬
df1.sort_values(axis=1, by='e', ascending=False)

    E   A   D   F   C
h  15  19  15   6  12
c  17   9  16  11  12
a   5  16  18   9  15
e  16  12   6   5   2

In [154]:
# 두 개의 컬럼에 대해서 정렬 : 리스트로 묶어서 by의 인자값으로 전달
# 정렬 우선순위 : 차례대로 1순위 > 2순위(1순위 동점시 2순위로 넘어감)
# 1순위 정렬 후 1순위 컬럼의 동점값에 대해 2순위 컬럼의 값이 재정렬
# 동일한 값이 아니라면 무조건 1순위 컬럼이 우선
df1.sort_values(by=['C','A'])

    E   A   F   C   D
e  16  12   5   2   6
c  17   9  11  12  16
h  15  19   6  12  15
a   5  16   9  15  18

In [158]:
# C는 오름차순 A는 내림차순으로 하고 싶다면
# ascending = [True, False] 와 같이 각각의 컬럼에 대해서 ascending을 따로 매겨준다
df1.sort_values(by=['C','A'], ascending=(True, False))

    E   A   F   C   D
e  16  12   5   2   6
h  15  19   6  12  15
c  17   9  11  12  16
a   5  16   9  15  18

### 연습문제

#### 1. 아래의 데이터프레임을 생성하세요

- 학생들의 점수는 50 이상 100 미만의 무작위 정수 값을 생성하여 사용

<img src='img/df_sort_practice1.png' width=250 align='left'>

In [179]:
# df = pd.DataFrame(np.random.randint(50, 100, 20).reshape(5, 4))


df = pd.DataFrame([[94,97,50,53],[53,89,59,69],[71,86,73,56],[74,74,62,51],[88,89,73,96]], index=['Kim', 'Park', 'Lee','Jung','Moon'], columns=[[2016,2016,2017,2017],['영어','수학','영어','수학']])
df

     2016     2017
       영어  수학   영어  수학
Kim    94  97   50  53
Park   53  89   59  69
Lee    71  86   73  56
Jung   74  74   62  51
Moon   88  89   73  96

In [180]:
df.index.name='학생명'
df

     2016     2017
       영어  수학   영어  수학
학생명
Kim    94  97   50  53
Park   53  89   59  69
Lee    71  86   73  56
Jung   74  74   62  51
Moon   88  89   73  96

In [202]:
df.columns.set_names(['년도','과목'], inplace=True)
df

년도   2016     2017
과목     영어  수학   영어  수학
학생명
Kim    94  97   50  53
Park   53  89   59  69
Lee    71  86   73  56
Jung   74  74   62  51
Moon   88  89   73  96

#### 2. 2016년 데이터만 별도의 데이터프레임으로 분리 저장하세요.(깊은복사)

In [203]:
df2016 = df.copy()
df2016

년도   2016     2017
과목     영어  수학   영어  수학
학생명
Kim    94  97   50  53
Park   53  89   59  69
Lee    71  86   73  56
Jung   74  74   62  51
Moon   88  89   73  96

#### 3. 2016년 데이터에 대해 학생이름을 기준으로 오름차순 정렬하세요

In [205]:
df2016.sort_index(ascending=False)

년도   2016     2017
과목     영어  수학   영어  수학
학생명
Park   53  89   59  69
Moon   88  89   73  96
Lee    71  86   73  56
Kim    94  97   50  53
Jung   74  74   62  51

#### 4. 2016년 데이터의 과목별 점수에 대하여 영어 점수가 높은 순서로 정렬하고, 영어 점수 동점자의 경우 수학 점수가 낮은 순서로 정렬

In [213]:
df2016.sort_values(axis=1, by=[2016],['영어','수학'], ascending=(False,True))

SyntaxError: positional argument follows keyword argument (256942424.py, line 1)